Tekla.Structures.Drawing.IResizeable
The IResizeable interface is implemented by objects that can be resized.
Tekla.Structures.Drawing.Size
Tekla.Structures.Drawing.IMovableRelative

Tekla.Structures.Drawing.IResizeable.Resize(Tekla.Structures.Drawing.Size)
Resizes the object to the specified size, overriding possible
scaling settings.
size: The new size.
Returns: True if succeeded.